Revit 2027 API
BuiltInFailures.ImportExportFailures.ViewBoundariesTooLarge Property
 The view boundaries are too large to export the view..
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ViewBoundariesTooLarge { get; }
Public Shared ReadOnly Property ViewBoundariesTooLarge As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ViewBoundariesTooLarge {
	FailureDefinitionId^ get ();
}
static member ViewBoundariesTooLarge : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportExportFailures Class
Autodesk.Revit.DB Namespace